UB_Copy/src/Documents/УБ_ПланированиеЦелейИПоказателей/УБ_ПланированиеЦелейИПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_ПланированиеЦелейИПоказателей</name>
  <registerRecords>InformationRegister.УБ_ПланПоПоказателям</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураПредприятия</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Горизонт</name>
    <comment>Горизонт планирования</comment>
    <type>
      <types>CatalogRef.УБ_ГоризонтыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждает</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.УБ_Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>DefinedType.УБ_НазначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>с таблицей Показатели по периодам</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеТип</name>
      <type>
        <types>DefinedType.УБ_НазначенияПоказателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>с таблицей Назначения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьПланирования</name>
      <type>
        <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиноеЗначениеПоказателя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазбитьНаПериоды</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчитатьНарастающийИтог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСПериодом</name>
      <comment>с таблицей Показатели по периодам</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НегативноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПозитивноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьКонтроля</name>
      <type>
        <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Календарь</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиКонтроляЗаполнены</name>
      <comment>для контроля показателя указан отдельный набор сотрудников</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.УБ_Цели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиПоПериодам</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееЗначение</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>НарастающийИтог</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСПериодом</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UB_Copy/src/InformationRegisters/УБ_ПланПоПоказателям/УБ_ПланПоПоказателям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ПланПоПоказателям</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТекущееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначениеНегативноеОтклонениеНормыДо</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначениеПограничноеОтклонениеНормыОт</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначениеПограничноеОтклонениеНормыДо</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначениеПозитивноеОтклонениеНормыОт</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтогНегативноеОтклонениеНормыДо</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтогПограничноеОтклонениеНормыОт</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтогПограничноеОтклонениеНормыДо</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтогПозитивноеОтклонениеНормыОт</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьКонтроляСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланированияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролирует</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждает</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>CatalogRef.УБ_Цели</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтруктураПредприятия</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <comment>Показатель эффективности</comment>
    <type>
      <types>CatalogRef.УБ_ПоказателиЭффективности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>DefinedType.УБ_НазначенияПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаНарастающего</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияНарастающего</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/Documents/УБ_ПланированиеЦелейИПоказателей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ Утвержден Тогда 
		 ОбработкаУдаленияПроведения(Отказ);
		Возврат;
	КонецЕсли; 
	
	УБ_ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.УБ_ПланированиеЦелейИПоказателей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	УБ_ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыСведений.УБ_ПланПоПоказателям.ЗаписатьЗапланированныеПоказатели(
		ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПланПоПоказателям, Движения, Отказ);
		
	УБ_ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	УБ_ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	УБ_ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
    
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;         
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Утвержден = Ложь;
	ИначеЕсли  РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос;     
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ТЧ_Назначения.Назначение КАК Назначение,
		|	ТЧ_Назначения.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ Назначения
		|ИЗ
		|	&ВТ_Назначения КАК ТЧ_Назначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Показатели.показатель КАК показатель,
		|	ВТ_Показатели.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ Показатели
		|ИЗ
		|	&ВТ_Показатели КАК ВТ_Показатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Назначения.Назначение КАК Назначение,
		|	Показатели.показатель КАК показатель
		|ИЗ
		|	Назначения КАК Назначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Показатели КАК Показатели
		|		ПО Назначения.КлючСвязи = Показатели.КлючСвязи";
		
		Запрос.УстановитьПараметр("ВТ_Назначения", Назначения.Выгрузить(, "Назначение, КлючСвязи"));
		Запрос.УстановитьПараметр("ВТ_Показатели", Показатели.Выгрузить(, "Показатель, КлючСвязи"));
		УБ_ПланированиеПоказателейСервер.ПроверитьСоответствиеНазначенийИПоказателей(Запрос.Выполнить().Выгрузить(), ДатаНачала, Отказ);
	КонецЕсли;
		
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();  
	
	//добавим строку по умолчанию с назначением для "Компания"
	СтрОтб = Новый Структура("НазначениеТип", УБ_ОбщегоНазначенияПовтИсп.ЗначениеРеквизитаПоУмолчанию("Компания"));
	Если Назначения.НайтиСтроки(СтрОтб).Количество() = 0 Тогда
		//строка всегда будет присутствовать, а показатель может и не определяться
		НовСтр = Назначения.Добавить();
		НовСтр.Назначение = Справочники.УБ_Компании.Компания;
		НовСтр.НазначениеТип =  УБ_ОбщегоНазначенияПовтИсп.ЗначениеРеквизитаПоУмолчанию("Компания");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// все назначения целей должны принадлежать иерархии Структуры предприятия
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Назначения.Цель КАК Цель,
	|	Назначения.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втНазначенияОбъекта
	|ИЗ
	|	&Назначения КАК Назначения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Представление(втНазначенияОбъекта.Цель) КАК Цель,
	|	втНазначенияОбъекта.НомерСтроки КАК НомерСтроки,
	|	Представление(втНазначенияОбъекта.Цель.ПринадлежностьЦели) КАК ПринадлежностьЦели
	|ИЗ
	|	втНазначенияОбъекта КАК втНазначенияОбъекта
	|ГДЕ
	|	НЕ втНазначенияОбъекта.Цель.ПринадлежностьЦели В ИЕРАРХИИ (&ПринадлежностьЦели)";

	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПринадлежностьЦели", СтруктураПредприятия);
	Запрос.УстановитьПараметр("Назначения", Назначения.Выгрузить());
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ПутьКЭлементу = СтрШаблон("Назначения[%1].Цель", Выборка.НомерСтроки - 1);
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Цель %1 принадлежит %2 и не входит в структуру предприятия!", 
															Выборка.Цель, Выборка.ПринадлежностьЦели)
															, ЭтотОбъект, ПутьКЭлементу,, Отказ);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти  

#КонецОбласти

#КонецЕсли      

//TODO ООО 17.11.2022  при удалении подразделения из документа - удалять данные настроек из регистра
